Разработка_GZ/src/Documents/ГЗ_ИзвещениеОПроведенииЗакупок/ГЗ_ИзвещениеОПроведенииЗакупок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ГЗ_ИзвещениеОПроведенииЗакупок</name>
  <registerRecords>InformationRegister.ГЗ_ЗакупкиПоОрганизациям</registerRecords>
  <registerRecords>InformationRegister.ГЗ_ЗакупкиПоРегионам</registerRecords>
  <attributes>
    <name>schemeVersion</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>id</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>externalId</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>purchaseNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>docNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>href</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>printForm</name>
    <comment>url - Ссылка для скачивания документа</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>extPrintForm</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>purchaseObjectInfo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>purchaseResponsible</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>isBudgetUnionState</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>isGOZ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>isBBST</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>placingWay</name>
    <type>
      <types>CatalogRef.ГЗ_placingWay_ПодспособОпределенияПоставщика</types>
    </type>
  </attributes>
  <attributes>
    <name>article15FeaturesInfo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>article15Attachments</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>contractConclusionOnSt83Ch2</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>okpd2okved2</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ETP</name>
    <type>
      <types>CatalogRef.ГЗ_ETP_ЭлектроннаяТорговаяПлощадка</types>
    </type>
  </attributes>
  <attributes>
    <name>totalSum</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>23</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>totalSumCurrency</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>23</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>collectiing_startDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>collectiing_place</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>collectiing_order</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>collectiing_endDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>collectiing_addInfo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>scoring_date</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>bidding_date</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>bidding_addinfo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>customerRequirements</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>modification</name>
    <comment>заполняется в случае внесения изменений в документы извещения</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>purchaseObjects</name>
    <attributes>
      <name>purchaseObject</name>
      <type>
        <types>CatalogRef.КлассификаторОКПД2</types>
      </type>
    </attributes>
    <attributes>
      <name>price</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>21</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>sum</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>21</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>isMedicalProduct</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>OKEI</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>name</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>purchaseObject_Строкой</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>customerQuantities</name>
    <attributes>
      <name>purchaseObject</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>customer</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Разработка_GZ/src/InformationRegisters/ГЗ_ЗакупкиПоОрганизациям/ГЗ_ЗакупкиПоОрганизациям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ГЗ_ЗакупкиПоОрганизациям</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОКПД2_Полный</name>
    <type>
      <types>CatalogRef.КлассификаторОКПД2</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОКПД2_3Уровень</name>
    <type>
      <types>CatalogRef.КлассификаторОКПД2</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОКПД2_2Уровень</name>
    <type>
      <types>CatalogRef.КлассификаторОКПД2</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОКПД2_1Уровень</name>
    <type>
      <types>CatalogRef.КлассификаторОКПД2</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончанияПодачиЗаявок</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Разработка_GZ/src/InformationRegisters/ГЗ_ЗакупкиПоРегионам/ГЗ_ЗакупкиПоРегионам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ГЗ_ЗакупкиПоРегионам</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>КодСубъектаРФ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОКПД2_Полный</name>
    <type>
      <types>CatalogRef.КлассификаторОКПД2</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОКПД2_3Уровень</name>
    <type>
      <types>CatalogRef.КлассификаторОКПД2</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОКПД2_2Уровень</name>
    <type>
      <types>CatalogRef.КлассификаторОКПД2</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОКПД2_1Уровень</name>
    <type>
      <types>CatalogRef.КлассификаторОКПД2</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончанияПодачиЗаявок</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Разработка_GZ/src/Documents/ГЗ_ИзвещениеОПроведенииЗакупок/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ

	// регистр ГЗ_ЗакупкиПоОрганизациям	
	Движения.ГЗ_ЗакупкиПоОрганизациям.Записывать = Истина;
	
	// регистр ГЗ_ЗакупкиПоРегионам
	Движения.ГЗ_ЗакупкиПоРегионам.Записывать = Истина;

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГЗ_ИзвещениеОПроведенииЗакупок.purchaseObject КАК purchaseObject,
		|	СУММА(ГЗ_ИзвещениеОПроведенииЗакупок.sum) КАК sum
		|ИЗ
		|	Документ.ГЗ_ИзвещениеОПроведенииЗакупок.purchaseObjects КАК ГЗ_ИзвещениеОПроведенииЗакупок
		|ГДЕ
		|	ГЗ_ИзвещениеОПроведенииЗакупок.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ГЗ_ИзвещениеОПроведенииЗакупок.purchaseObject";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Движение = Движения.ГЗ_ЗакупкиПоОрганизациям.Добавить();
		Движение.Организация = Ссылка.Организация;
		Движение.Период = Ссылка.Дата;
		Движение.ОКПД2_Полный = ВыборкаДетальныеЗаписи.purchaseObject;
		
		МассивОКПД2 = СтрРазделить(Движение.ОКПД2_Полный, ".",Истина);
		
		Если МассивОКПД2.Количество() = 4 Тогда 
			Движение.ОКПД2_3Уровень = Справочники.КлассификаторОКПД2.НайтиПоКоду(МассивОКПД2[0]+"."+МассивОКПД2[1]+"."+МассивОКПД2[2]);
			Движение.ОКПД2_2Уровень = Справочники.КлассификаторОКПД2.НайтиПоКоду(МассивОКПД2[0]+"."+МассивОКПД2[1]);
			Движение.ОКПД2_1Уровень = Справочники.КлассификаторОКПД2.НайтиПоКоду(МассивОКПД2[0]);
		ИначеЕсли  МассивОКПД2.Количество() = 3 Тогда 
			//Движение.ОКПД2_3Уровень = Справочники.КлассификаторОКПД2.НайтиПоКоду(МассивОКПД2[0]+"."+МассивОКПД2[1]+"."+МассивОКПД2[2]);
			Движение.ОКПД2_2Уровень = Справочники.КлассификаторОКПД2.НайтиПоКоду(МассивОКПД2[0]+"."+МассивОКПД2[1]);
			Движение.ОКПД2_1Уровень = Справочники.КлассификаторОКПД2.НайтиПоКоду(МассивОКПД2[0]);
	    ИначеЕсли  МассивОКПД2.Количество() = 2 Тогда 
			//Движение.ОКПД2_3Уровень = Справочники.КлассификаторОКПД2.НайтиПоКоду(МассивОКПД2[0]+"."+МассивОКПД2[1]+"."+МассивОКПД2[2]);
			//Движение.ОКПД2_2Уровень = Справочники.КлассификаторОКПД2.НайтиПоКоду(МассивОКПД2[0]+"."+МассивОКПД2[1]);
			Движение.ОКПД2_1Уровень = Справочники.КлассификаторОКПД2.НайтиПоКоду(МассивОКПД2[0]);

		КонецЕсли;

		Движение.ДатаОкончанияПодачиЗаявок = Ссылка.collectiing_endDate;
		Движение.Сумма = ВыборкаДетальныеЗаписи.sum;
		
		
		ДвижениеПоРегионам = Движения.ГЗ_ЗакупкиПоРегионам.Добавить();
		ДвижениеПоРегионам.КодСубъектаРФ = Лев(Ссылка.Организация.ИНН, 2);
		ДвижениеПоРегионам.Период=Ссылка.Дата;
		ДвижениеПоРегионам.ОКПД2_Полный = ВыборкаДетальныеЗаписи.purchaseObject;
		
		МассивОКПД2 = СтрРазделить(Движение.ОКПД2_Полный, ".",Истина);
		
		Если МассивОКПД2.Количество() = 4 Тогда 
			ДвижениеПоРегионам.ОКПД2_3Уровень = Справочники.КлассификаторОКПД2.НайтиПоКоду(МассивОКПД2[0]+"."+МассивОКПД2[1]+"."+МассивОКПД2[2]);
			ДвижениеПоРегионам.ОКПД2_2Уровень = Справочники.КлассификаторОКПД2.НайтиПоКоду(МассивОКПД2[0]+"."+МассивОКПД2[1]);
			ДвижениеПоРегионам.ОКПД2_1Уровень = Справочники.КлассификаторОКПД2.НайтиПоКоду(МассивОКПД2[0]);
		ИначеЕсли МассивОКПД2.Количество() = 3 Тогда 
			//Движение.ОКПД2_3Уровень = Справочники.КлассификаторОКПД2.НайтиПоКоду(МассивОКПД2[0]+"."+МассивОКПД2[1]+"."+МассивОКПД2[2]);
			ДвижениеПоРегионам.ОКПД2_2Уровень = Справочники.КлассификаторОКПД2.НайтиПоКоду(МассивОКПД2[0]+"."+МассивОКПД2[1]);
			ДвижениеПоРегионам.ОКПД2_1Уровень = Справочники.КлассификаторОКПД2.НайтиПоКоду(МассивОКПД2[0]);
	    ИначеЕсли  МассивОКПД2.Количество() = 2 Тогда 
			//Движение.ОКПД2_3Уровень = Справочники.КлассификаторОКПД2.НайтиПоКоду(МассивОКПД2[0]+"."+МассивОКПД2[1]+"."+МассивОКПД2[2]);
			//Движение.ОКПД2_2Уровень = Справочники.КлассификаторОКПД2.НайтиПоКоду(МассивОКПД2[0]+"."+МассивОКПД2[1]);
			ДвижениеПоРегионам.ОКПД2_1Уровень = Справочники.КлассификаторОКПД2.НайтиПоКоду(МассивОКПД2[0]);
		КонецЕсли;
		
		ДвижениеПоРегионам.ДатаОкончанияПодачиЗаявок = Ссылка.collectiing_endDate;
		ДвижениеПоРегионам.Сумма = ВыборкаДетальныеЗаписи.sum;

		
	КонецЦикла;

	

КонецПроцедуры
